snlkuharlocal/src/DataProcessors/АРМ_ЗакрытиеМинусов/АРМ_ЗакрытиеМинусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМ_ЗакрытиеМинусов</name>
  <attributes>
    <name>ФизическийСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыСПроблемнойДатойВременем</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеДокумента</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВиртуальныеПРМкУдалению</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладПолучатель</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПеремещениеДляОбнуленияВиртуальныхСкладов</name>
    <attributes>
      <name>ВиртуальныйСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПеремещенияНаВиртуальныеСклады</name>
    <attributes>
      <name>ВиртуальныйСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>День</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПеремещенияСВиртуальныхСкладов</name>
    <attributes>
      <name>ВиртуальныйСклад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>День</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработанныеДни</name>
    <attributes>
      <name>День</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинусаЗакрыты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзлишкиЗабраны</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньОбработан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ДанныеЗакрытияМесяцаПоСкладу/ДанныеЗакрытияМесяцаПоСкладу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗакрытияМесяцаПоСкладу</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/АРМ_ЗакрытиеМинусов/ManagerModule.bsl
&НаСервере               
//Смещает исходящие ПРМ (кроме виртуальных) и РНК от 1го числа закрываемого месяц
//на некоторое количество секунд, чтобы можно было делать  ПРМ раньше  накладных
Процедура ПеренестиВремяИсходящихНакладных(МассивДокументов,СмещениеПоДате,ДопПараметры = Неопределено) экспорт
	ВыполнятьФоново = Истина;
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда 
		если ДопПараметры.Свойство("ВыполнятьФоново") и ДопПараметры.ВыполнятьФоново = ложь тогда
			ВыполнятьФоново = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//ПараметрыСеанса.ЗапущенаОбработка = Истина;
	МассивСообщений = новый массив;
	
	КоличествоСтрок = МассивДокументов.Количество();
	Сч=1;
	для каждого Документ из МассивДокументов цикл 
		попытка    
			ДокОбъект = Документ.ПолучитьОбъект();  
			ДокОбъект.Дата = НачалоДня(ДокОбъект.дата)+СмещениеПоДате;  
			
			ДокОбъект.ЗаписьБезКонтроляПолномочий(); 
			МассивСообщений.Добавить(СтрШаблон("Успешно изменено время в %1.",ДокОбъект));
		Исключение   
			МассивСообщений.Добавить(СтрШаблон("Не удалось записать %1. %2",ДокОбъект,ОписаниеОшибки()));
		КонецПопытки;	
		
		если ВыполнятьФоново тогда
			Процент = 100*сч/КоличествоСтрок; 
			УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияПереносВремениДокументов",Процент);  
			если Сч = 1 тогда    
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеПереносВремениДокументов","Стартовала фоновая запись документов. Дождитесь сообщения о завершении либо отмените через консоль заданий.");
			КонецЕсли;   
		КонецЕсли;      
		
		сч= сч+1;
	КонецЦикла;                   
	
	
	//ПараметрыСеанса.ЗапущенаОбработка = Ложь;
	
	если ВыполнятьФоново тогда
		УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияПереносВремениДокументов",1000);
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеПереносВремениДокументов",СтрСоединить(МассивСообщений,символы.ПС));  
	иначе
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = СтрСоединить(МассивСообщений,символы.ПС);
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры


&НаСервере 
//Распроведение виртуальных ПРМ по одному физ. складу.
Процедура РаспровестиВиртуальныеПРМ(МассивДокументов,ФизическийСклад,ЗакрываемыйМесяц,ДопПараметры = Неопределено) экспорт
	ВыполнятьФоново = Истина;
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда 
		если ДопПараметры.Свойство("ВыполнятьФоново") и ДопПараметры.ВыполнятьФоново = ложь тогда
			ВыполнятьФоново = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//ПараметрыСеанса.ЗапущенаОбработка = Истина;
	МассивСообщений = новый массив;
	
	КоличествоСтрок = МассивДокументов.Количество();
	Сч=1;
	
	МассивРаспроведенныхПРМ = новый Массив;
	
	
	для каждого Документ из МассивДокументов цикл
		попытка
			ДокОбъект = Документ.ПолучитьОбъект();   
			ДокОбъект.УстановитьПометкуУдаления(Истина);
			МассивСообщений.Добавить(СтрШаблон("Успешно помечен на удаление %1.",ДокОбъект));  
			МассивРаспроведенныхПРМ.Добавить(Документ);
		Исключение   
			МассивСообщений.Добавить(СтрШаблон("Не удалось пометить на удаление %1. %2",ДокОбъект,ОписаниеОшибки()));
		КонецПопытки;
		
		если ВыполнятьФоново тогда
			Процент = 100*сч/КоличествоСтрок; 
			УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияРаспровестиВиртуальныеПРМ",Процент);  
			если Сч = 1 тогда    
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеРаспровестиВиртуальныеПРМ","Стартовала фоновая запись документов. Дождитесь сообщения о завершении либо отмените через консоль заданий.");
			КонецЕсли;   
		КонецЕсли;      
		
		сч= сч+1;
		
	КонецЦикла;      
	
	ЗаписатьМассивДанныхВДанныеЗакрытияМесяцаПоСкладу (ФизическийСклад,ЗакрываемыйМесяц,МассивРаспроведенныхПРМ,"МассивРаспроводимыхВиртуальныхПРМ");

	//ПараметрыСеанса.ЗапущенаОбработка = Ложь;

	
	если ВыполнятьФоново тогда
		УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияРаспровестиВиртуальныеПРМ",1000);
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеРаспровестиВиртуальныеПРМ",СтрСоединить(МассивСообщений,символы.ПС));  
	иначе
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = СтрСоединить(МассивСообщений,символы.ПС);
		Сообщение.Сообщить();
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере  
//Перемещение под 0 на весь товар с виртуальных складов на физический
Процедура СоздатьПРМДляОбнуленияВиртуальныхСкладов(ФизическийСклад,ЗакрываемыйМесяц,ДопПараметры = Неопределено) экспорт  
	ВыполнятьФоново = Истина;
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда 
		если ДопПараметры.Свойство("ВыполнятьФоново") и ДопПараметры.ВыполнятьФоново = ложь тогда
			ВыполнятьФоново = Ложь;
		КонецЕсли;
	КонецЕсли;
	//ПараметрыСеанса.ЗапущенаОбработка = Истина;
	МассивСообщений = новый массив;
	
	МассивСозданныхПРМ = новый Массив;
	
	
	МассивСкладов = ПолучитьМассивВиртуальныхСкладов(ФизическийСклад,ложь);     
	ЗапросИзлишки = новый запрос;    
	ЗапросИзлишки.УстановитьПараметр("МассивСкладов",МассивСкладов);	
	ЗапросИзлишки.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Склад КАК Склад,
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0
	|ИТОГИ
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Склад";	  
	ЗапросИзлишки.УстановитьПараметр("Дата2",НачалоМесяца(ЗакрываемыйМесяц)+1);	
	
	ВыборкаПоСкладам = ЗапросИзлишки.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
	Пока ВыборкаПоСкладам.Следующий() цикл

		ПРМОб = СоздатьПеремещение(ВыборкаПоСкладам.Склад,ФизическийСклад,НачалоМесяца(ЗакрываемыйМесяц),"Создано обработкой закрытия минусов. Для временного обнуления вирт. складов");

		ВыборкаПоТоварам = ВыборкаПоСкладам.Выбрать();  
		Сч=1;      
		КоличествоСТрок = ВыборкаПоТоварам.Количество();

		если ВыполнятьФоново тогда
			УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеПРМДляОбнуленияВиртуальныхСкладовНаСервере",
			СтрШаблон("Создаётся ПРМ с %1 количество строк %2",ВыборкаПоСкладам.Склад,КоличествоСтрок));
		КонецЕсли;
		пока ВыборкаПоТоварам.Следующий() цикл
			ДобавитьСтрокуПРМ(ПРМОб,ВыборкаПоТоварам.Номенклатура,ВыборкаПоТоварам.КоличествоОстаток);		
			если ВыполнятьФоново тогда
				Процент = 100*сч/КоличествоСтрок; 
				УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияПРМДляОбнуленияВиртуальныхСкладовНаСервере",Процент);  
			КонецЕсли;      
			сч = сч+1;
		КонецЦикла;      
		
		
		если ВыполнятьФоново тогда			
			УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеПРМДляОбнуленияВиртуальныхСкладовНаСервере",
			СтрШаблон("Начало проведения %1 по складу %2", ПРМОб.Номер,ВыборкаПоСкладам.Склад));
		КонецЕсли;        
		
		попытка
			ПРМОб.Записать(РежимЗаписиДокумента.Проведение);   
			МассивСозданныхПРМ.Добавить(ПРМОб.Ссылка);   
			если ВыполнятьФоново тогда			
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеПРМДляОбнуленияВиртуальныхСкладовНаСервере",
				СтрШаблон("ПРМ %1 проведен", ПРМОб.Номер));
			КонецЕсли;      
		Исключение       
			МассивСообщений.Добавить(СтрШаблон("Не удалось создать ПРМ со склада %1. %2",ВыборкаПоСкладам.Склад,ОписаниеОшибки())); 
			если ВыполнятьФоново тогда			
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеПРМДляОбнуленияВиртуальныхСкладовНаСервере",
				СтрШаблон("ПРМ %1 не проведен %2", ПРМОб.Номер, ОписаниеОшибки()));
			КонецЕсли;     
		КонецПопытки;
	КонецЦикла;	
	
	//ПараметрыСеанса.ЗапущенаОбработка = ложь;

	ЗаписатьМассивДанныхВДанныеЗакрытияМесяцаПоСкладу(ФизическийСклад,ЗакрываемыйМесяц,МассивСозданныхПРМ,"МассивПРМДляОбнуленияВиртСкладов");
	
	если ВыполнятьФоново тогда
		УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияПРМДляОбнуленияВиртуальныхСкладовНаСервере",1000);
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеПРМДляОбнуленияВиртуальныхСкладовНаСервере",СтрСоединить(МассивСообщений,символы.ПС));        	
	иначе
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = СтрСоединить(МассивСообщений,символы.ПС);
		Сообщение.Сообщить();
	КонецЕсли;	
	

КонецПроцедуры


&НаСервере
//По каждому дню, сначало на начало дня под отгрузку с вирт. складов перемещает товар с физического
//Потом перемещает обратно если есть излишек (возвраты в течении дня)
Процедура СоздатьПРМДляВыравниванияОстатковПоДням (ФизическийСклад,МассивДней,ПропускатьПроблемныеДни,ДопПараметры) экспорт  
	
	ВыполнятьФоново = Истина;
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда 
		если ДопПараметры.Свойство("ВыполнятьФоново") и ДопПараметры.ВыполнятьФоново = ложь тогда
			ВыполнятьФоново = Ложь;
		КонецЕсли;
	КонецЕсли;
	//ПараметрыСеанса.ЗапущенаОбработка = Истина;
	МассивСообщений = новый массив;
	МассивСкладов = ПолучитьМассивВиртуальныхСкладов(ФизическийСклад,ложь);     
	
	МассивПРМНаВиртуальныеСклады = новый Массив;
	МассивПРМСВиртуальныхСкладов = новый Массив;

	если МассивДней.количество() = 0 тогда
		МассивСообщений.Добавить("Пустое количество дней для закрытия минусов");  
		
		если ВыполнятьФоново тогда
			УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",СтрСоединить(МассивСообщений,символы.ПС));        		
		иначе
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = СтрСоединить(МассивСообщений,символы.ПС);
			Сообщение.Сообщить();
		КонецЕсли;	
		
		возврат;
	КонецЕсли;
	
	ТЗДней = новый ТаблицаЗначений;
	ТЗДней.Колонки.Добавить("День");   
	для Каждого СтрМассива из МассивДней Цикл       
		СтрТЗ = ТЗДней.Добавить();
		СтрТЗ.День = СтрМассива;
	КонецЦикла;       
	ТЗДней.Свернуть("День");
	ТЗДней.Сортировать("День");
	
	
	ЗакрываемыйМесяц = НачалоМесяца(МассивДней[0]);
	
	ЗапросИзлишки = новый запрос;    
	ЗапросИзлишки.УстановитьПараметр("МассивСкладов",МассивСкладов);	
	ЗапросИзлишки.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Склад КАК Склад,
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0
	|ИТОГИ
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Склад";	  
	
	ЗапросМинуса = новый запрос;    
	ЗапросМинуса.УстановитьПараметр("МассивСкладов",МассивСкладов);	
	ЗапросМинуса.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Склад КАК Склад,
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Дата2,
	|			Склад В (&МассивСкладов)
	|				И Номенклатура В (&МассивНоменклатуры)) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток < 0
	|ИТОГИ
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Склад";	 
	
	ЗапросМинусаТолькоНоменклатура = новый запрос;    
	ЗапросМинусаТолькоНоменклатура.УстановитьПараметр("МассивСкладов",МассивСкладов);	
	ЗапросМинусаТолькоНоменклатура.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                                       |	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	                                       |	ОстаткиТМЦОстатки.Склад КАК Склад
	                                       |ИЗ
	                                       |	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
	                                       |ГДЕ
	                                       |	ОстаткиТМЦОстатки.КоличествоОстаток < 0";	 	
	
	ЗапросНаличиеНаФизСкладе = новый запрос;    
	ЗапросНаличиеНаФизСкладе.УстановитьПараметр("Склад",ФизическийСклад);	
	ЗапросНаличиеНаФизСкладе.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Дата2,
	|			Склад = &Склад
	|				И Номенклатура В (&МассивНоменклатуры)) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0";	
	
	
	

	ЗапросМинусаВСерединеДня = новый запрос;    
	ЗапросМинусаВСерединеДня.УстановитьПараметр("МассивСкладов",МассивСкладов);	
	ЗапросМинусаВСерединеДня.Текст = "ВЫБРАТЬ
	                                 |	Остатки.КоличествоКонечныйОстаток КАК КоличествоОстаток,
	                                 |	Остатки.Номенклатура КАК Номенклатура,
	                                 |	Остатки.Склад КАК Склад
	                                 |ИЗ
	                                 |	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Запись, , Склад В (&МассивСкладов)) КАК Остатки
	                                 |ГДЕ
	                                 |	Остатки.КоличествоКонечныйОстаток < 0
	                                 |ИТОГИ
	                                 |	МИНИМУМ(КоличествоОстаток)
	                                 |ПО
	                                 |	Склад";	 
	

	ЗапросМинусаВСерединеДняТолькоНоменклатура = новый запрос;    
	ЗапросМинусаВСерединеДняТолькоНоменклатура.УстановитьПараметр("МассивСкладов",МассивСкладов);	
	ЗапросМинусаВСерединеДняТолькоНоменклатура.Текст = "ВЫБРАТЬ
	|	Остатки.КоличествоКонечныйОстаток КАК КоличествоОстаток,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1, &Дата2, Запись, , Склад В (&МассивСкладов)) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоКонечныйОстаток < 0";	
	
	
	
	НеУдалосьЗакрытьДень = ложь;
	
	Для Каждого СтрокаТаблицыДней из ТЗДней цикл     
		ТекДень = СтрокаТаблицыДней.День;
		
		ЗаписатьОбработанныеДни(ФизическийСклад,НачалоМесяца(ТекДень),ТекДень);   
		
		если Лев(Строка(ТекДень),2) = "01" тогда //Для 1го числа, мы смещали отгрузки вперёд по дате, можно ставить началом дня. Для остальных дней, ПРМ окончание предыдущего дня
			ДатаДляПРМ = НачалоДня(ТекДень); 
		иначе
			ДатаДляПРМ = НачалоДня(ТекДень)-1; 	
		КонецЕсли;
		
		если ВыполнятьФоново тогда			
			УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
			СтрШаблон("Обработка дня %1",ТекДень));
		КонецЕсли;      
		
		ЗапросМинусаТолькоНоменклатура.УстановитьПараметр("Дата2",КонецДня(ТекДень)+1);	
		МассивНоменклатуры = ЗапросМинусаТолькоНоменклатура.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"); 
		//если МассивНоменклатуры.Количество() = 0 тогда
		//	Продолжить;
		//КонецЕсли;
		
		ЗапросМинуса.УстановитьПараметр("Дата2",КонецДня(ТекДень)+1);  
		ЗапросМинуса.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры); 
		
		ЗапросНаличиеНаФизСкладе.УстановитьПараметр("Дата2",НачалоДня(ТекДень)+1); 
		ЗапросНаличиеНаФизСкладе.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры); 
		ТаблицаНаличия = ЗапросНаличиеНаФизСкладе.Выполнить().Выгрузить();
		
		ВыборкаМинусаСклады = ЗапросМинуса.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");     
		
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
		СтрШаблон("Обработка закрытия минусов склада %1 за день %2",ВыборкаМинусаСклады.Склад,ТекДень));
		
		пока ВыборкаМинусаСклады.Следующий() цикл
			ВыборкаМинусаДетально = ВыборкаМинусаСклады.Выбрать();
			КоличествоСтрок = ВыборкаМинусаДетально.Количество();          
			
			если ВыполнятьФоново тогда			
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
				СтрШаблон("Обработка закрытия минусов по складу %1 за день %2",ВыборкаМинусаСклады.Склад,ТекДень));
			КонецЕсли;	
			
			ПРМОб = СоздатьПеремещение(ФизическийСклад,ВыборкаМинусаСклады.Склад,ДатаДляПРМ, СтрШаблон("Создано обработкой закрытия минусов. Для пополнения вирт. складов на %1.",Формат(ТекДень,"ДФ=dd.MM.yyyy"))); 
			
			если ВыполнятьФоново тогда
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
				СтрШаблон("Создаётся ПРМ с %1 количество строк %2",ВыборкаМинусаДетально.Склад,КоличествоСтрок));
			КонецЕсли;
			
			СчСтрокТовары = 1;
			пока ВыборкаМинусаДетально.Следующий() цикл 
				Номенклатура = ВыборкаМинусаДетально.Номенклатура;  
				ЕстьВНаличии = 0;
				НужноСписать = -ВыборкаМинусаДетально.КоличествоОстаток;
				СтрокаНаличия = ТаблицаНаличия.Найти(Номенклатура,"Номенклатура");
				если СтрокаНаличия <> Неопределено тогда 
					если СтрокаНаличия.КоличествоОстаток < НужноСписать тогда
						НеУдалосьЗакрытьДень = Истина;
						МассивСообщений.Добавить(СтрШаблон("Неудалось закрыть день по складу %6 %1 из-за номенклатуры %2 с кодом %3. Нужно %4, есть в наличии %5",
						ТекДень,Номенклатура,номенклатура.код,НужноСписать,СтрокаНаличия.КоличествоОстаток, ВыборкаМинусаСклады.Склад));    
						НужноСписать =  СтрокаНаличия.КоличествоОстаток;
						СтрокаНаличия.КоличествоОстаток = 0;
					Иначе
						СтрокаНаличия.КоличествоОстаток = СтрокаНаличия.КоличествоОстаток - НужноСписать;
					КонецЕсли;                         
				иначе
					НеУдалосьЗакрытьДень = Истина;
					МассивСообщений.Добавить(СтрШаблон("Неудалось закрыть день %1 по складу %6 из-за номенклатуры %2 с кодом %3. Нужно %4, есть в наличии %5",
					ТекДень,Номенклатура,номенклатура.код,НужноСписать,0, ВыборкаМинусаСклады.Склад));    					
					Продолжить;				
				КонецЕсли;  
				
				ДобавитьСтрокуПРМ(ПРМОб,ВыборкаМинусаДетально.Номенклатура,НужноСписать);	
				если ВыполнятьФоново тогда
					Процент = 100*СчСтрокТовары/КоличествоСтрок; 
					УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияСоздатьПРМДляОбработкиДнейНаСервере",Процент);  
				КонецЕсли;  
				СчСтрокТовары = СчСтрокТовары + 1; 
			КонецЦикла; 
			
			если ПРМОб.Товары.Итог("Количество")> 0 тогда    		
				попытка
					ПРМОб.Записать(РежимЗаписиДокумента.Проведение);   
					МассивПРМНаВиртуальныеСклады.Добавить(ПРМОб.Ссылка);   
					если ВыполнятьФоново тогда			
						УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
						СтрШаблон("ПРМ %1 проведен", ПРМОб.Номер));
					КонецЕсли;      
				Исключение       
					МассивСообщений.Добавить(СтрШаблон("Не удалось создать ПРМ со склада %1. %2",ВыборкаМинусаСклады.Склад,ОписаниеОшибки())); 
					если ВыполнятьФоново тогда			
						УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
						СтрШаблон("ПРМ %1 не проведен %2", ПРМОб.Номер, ОписаниеОшибки()));
					КонецЕсли;     
				КонецПопытки;
			КонецЕсли;	
		КонецЦикла;   
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//Минуса в середине дня начало
		
		

		ЗапросМинусаВСерединеДняТолькоНоменклатура.УстановитьПараметр("Дата1",НачалоДня(ТекДень));			
		ЗапросМинусаВСерединеДняТолькоНоменклатура.УстановитьПараметр("Дата2",КонецДня(ТекДень));	
		МассивНоменклатуры = ЗапросМинусаВСерединеДняТолькоНоменклатура.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"); 
		//если МассивНоменклатуры.Количество() = 0 тогда
		//	Продолжить;
		//КонецЕсли;
		//
  		ЗапросМинусаВСерединеДня.УстановитьПараметр("Дата1",НачалоДня(ТекДень));  
		ЗапросМинусаВСерединеДня.УстановитьПараметр("Дата2",КонецДня(ТекДень));  
		ЗапросМинусаВСерединеДня.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры); 
		
		ЗапросНаличиеНаФизСкладе.УстановитьПараметр("Дата2",НачалоДня(ТекДень)+1); 
		ЗапросНаличиеНаФизСкладе.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры); 
		ТаблицаНаличия = ЗапросНаличиеНаФизСкладе.Выполнить().Выгрузить();
		
		ВыборкаМинусаСклады = ЗапросМинусаВСерединеДня.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");     
		
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
		СтрШаблон("Обработка закрытия промежуточных минусов склада %1 за день %2",ВыборкаМинусаСклады.Склад,ТекДень));
		
		пока ВыборкаМинусаСклады.Следующий() цикл
			ВыборкаМинусаДетально = ВыборкаМинусаСклады.Выбрать();
			КоличествоСтрок = ВыборкаМинусаДетально.Количество();          
			
			если ВыполнятьФоново тогда			
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
				СтрШаблон("Обработка закрытия промежуточных минусов по складу %1 за день %2",ВыборкаМинусаСклады.Склад,ТекДень));
			КонецЕсли;	
			
			ПРМОб = СоздатьПеремещение(ФизическийСклад,ВыборкаМинусаСклады.Склад,ДатаДляПРМ, СтрШаблон("Создано обработкой закрытия минусов. Для пополнения вирт. складов на %1.",Формат(ТекДень,"ДФ=dd.MM.yyyy"))); 
			
			если ВыполнятьФоново тогда
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
				СтрШаблон("Создаётся ПРМ на промежуточные минуса с %1 количество строк %2",ВыборкаМинусаДетально.Склад,КоличествоСтрок));
			КонецЕсли;
			
			СчСтрокТовары = 1;
			пока ВыборкаМинусаДетально.Следующий() цикл 
				Номенклатура = ВыборкаМинусаДетально.Номенклатура;  
				ЕстьВНаличии = 0;
				НужноСписать = -ВыборкаМинусаДетально.КоличествоОстаток;
				СтрокаНаличия = ТаблицаНаличия.Найти(Номенклатура,"Номенклатура");
				если СтрокаНаличия <> Неопределено тогда 
					если СтрокаНаличия.КоличествоОстаток < НужноСписать тогда
						НеУдалосьЗакрытьДень = Истина;
						МассивСообщений.Добавить(СтрШаблон("Неудалось закрыть день по складу %6 %1 из-за номенклатуры %2 с кодом %3. Нужно %4, есть в наличии %5",
						ТекДень,Номенклатура,номенклатура.код,НужноСписать,СтрокаНаличия.КоличествоОстаток, ВыборкаМинусаСклады.Склад));    
						НужноСписать =  СтрокаНаличия.КоличествоОстаток;
						СтрокаНаличия.КоличествоОстаток = 0;
					Иначе
						СтрокаНаличия.КоличествоОстаток = СтрокаНаличия.КоличествоОстаток - НужноСписать;
					КонецЕсли;                         
				иначе
					НеУдалосьЗакрытьДень = Истина;
					МассивСообщений.Добавить(СтрШаблон("Неудалось закрыть день %1 по складу %6 из-за номенклатуры %2 с кодом %3. Нужно %4, есть в наличии %5",
					ТекДень,Номенклатура,номенклатура.код,НужноСписать,0, ВыборкаМинусаСклады.Склад));    					
					Продолжить;				
				КонецЕсли;  
				
				ДобавитьСтрокуПРМ(ПРМОб,ВыборкаМинусаДетально.Номенклатура,НужноСписать);	
				если ВыполнятьФоново тогда
					Процент = 100*СчСтрокТовары/КоличествоСтрок; 
					УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияСоздатьПРМДляОбработкиДнейНаСервере",Процент);  
				КонецЕсли;  
				СчСтрокТовары = СчСтрокТовары + 1; 
			КонецЦикла; 
			
			если ПРМОб.Товары.Итог("Количество")> 0 тогда    		
				попытка
					ПРМОб.Записать(РежимЗаписиДокумента.Проведение);   
					МассивПРМНаВиртуальныеСклады.Добавить(ПРМОб.Ссылка);   
					если ВыполнятьФоново тогда			
						УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
						СтрШаблон("ПРМ %1 проведен", ПРМОб.Номер));
					КонецЕсли;      
				Исключение       
					МассивСообщений.Добавить(СтрШаблон("Не удалось создать ПРМ со склада %1. %2",ВыборкаМинусаСклады.Склад,ОписаниеОшибки())); 
					если ВыполнятьФоново тогда			
						УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
						СтрШаблон("ПРМ %1 не проведен %2", ПРМОб.Номер, ОписаниеОшибки()));
					КонецЕсли;     
				КонецПопытки;
			КонецЕсли;	
		КонецЦикла;   
		
		//Минуса в середине дня окончание		
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		
		
		
		ЗапросИзлишки.УстановитьПараметр("Дата2",КонецДня(ТекДень)+1);	
		ВыборкаПоСкладам = ЗапросИзлишки.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");   
		Пока ВыборкаПоСкладам.Следующий() цикл   
			
			если ВыполнятьФоново тогда			
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
				СтрШаблон("Обработка изьятия излишков склада %1 за день %2",ВыборкаПоСкладам.Склад,ТекДень));
			КонецЕсли;	
			
			ПРМОб = СоздатьПеремещение(ВыборкаПоСкладам.Склад,ФизическийСклад,КонецДня(ТекДень),СтрШаблон("Создано обработкой закрытия минусов. Для обнуления излишков за %1",Формат(ТекДень,"ДФ=dd.MM.yyyy")));      
			
			ВыборкаПоТоварам = ВыборкаПоСкладам.Выбрать();    
			КоличествоСтрок = ВыборкаПоСкладам.Количество();
			
			СчСтрокТовары=1;      
			КоличествоСТрок = ВыборкаПоТоварам.Количество();
			
			если ВыполнятьФоново тогда
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
				СтрШаблон("Создаётся ПРМ с %1 количество строк %2",ВыборкаПоСкладам.Склад,КоличествоСтрок));
			КонецЕсли;
			пока ВыборкаПоТоварам.Следующий() цикл
				ДобавитьСтрокуПРМ(ПРМОб,ВыборкаПоТоварам.Номенклатура,ВыборкаПоТоварам.КоличествоОстаток);
				если ВыполнятьФоново тогда
					Процент = 100*СчСтрокТовары/КоличествоСтрок; 
					УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияСоздатьПРМДляОбработкиДнейНаСервере",Процент);  
				КонецЕсли;      
				СчСтрокТовары = СчСтрокТовары+1;
			КонецЦикла;             				
			если ВыполнятьФоново тогда			
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
				СтрШаблон("Начало проведения %1 по складу %2", ПРМОб.Номер,ВыборкаПоСкладам.Склад));
			КонецЕсли;        
			
			попытка
				ПРМОб.Записать(РежимЗаписиДокумента.Проведение);   
				МассивПРМСВиртуальныхСкладов.Добавить(ПРМОб.Ссылка);   
				если ВыполнятьФоново тогда			
					УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
					СтрШаблон("ПРМ %1 проведен", ПРМОб.Номер));
				КонецЕсли;      
			Исключение       
				МассивСообщений.Добавить(СтрШаблон("Не удалось создать ПРМ со склада %1. %2",ВыборкаПоСкладам.Склад,ОписаниеОшибки())); 
				если ВыполнятьФоново тогда			
					УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",
					СтрШаблон("ПРМ %1 не проведен %2", ПРМОб.Номер, ОписаниеОшибки()));
				КонецЕсли;     
			КонецПопытки;
		КонецЦикла;
		
	КонецЦикла;
	
	
	//
	//
	//ПараметрыСеанса.ЗапущенаОбработка = ложь;
	
	ЗаписатьМассивДанныхВДанныеЗакрытияМесяцаПоСкладу(ФизическийСклад,ЗакрываемыйМесяц,МассивПРМНаВиртуальныеСклады,"МассивПеремещенияНаВиртуальныеСклады");
	ЗаписатьМассивДанныхВДанныеЗакрытияМесяцаПоСкладу(ФизическийСклад,ЗакрываемыйМесяц,МассивПРМСВиртуальныхСкладов,"МассивПеремещенияПеремещенияСВиртуальныхСкладов");

	 МассивСообщений.Добавить("Обработка завершена!!!");
	
	если ВыполнятьФоново тогда
		УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияСоздатьПРМДляОбработкиДнейНаСервере",1000);
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеСоздатьПРМДляОбработкиДнейНаСервере",СтрСоединить(МассивСообщений,символы.ПС));        		
	иначе
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = СтрСоединить(МассивСообщений,символы.ПС);
		Сообщение.Сообщить();
	КонецЕсли;	
	
	
	
КонецПроцедуры

 &НаСервере       
Процедура ЗаписатьОбработанныеДни(Склад,Месяц,День) экспорт     
	если не ЗначениеЗаполнено(склад) тогда
		ВызватьИсключение "Заполните склад";
	КонецЕсли;
	
	если не ЗначениеЗаполнено(Месяц) тогда
		ВызватьИсключение "Заполните месяц";
	КонецЕсли;
	
	
	ЗначенияДанных = ПрочитатьДанныеЗакрытияМесяцаПоСкладу(Склад,Месяц);
	
	если ЗначенияДанных = Неопределено тогда
		ЗначенияДанных = новый Структура();
	КонецЕсли;                
	
	если не ЗначенияДанных.Свойство("МассивОбработанныхДней") тогда
		ЗначенияДанных.Вставить("МассивОбработанныхДней");  
		ЗначенияДанных.МассивОбработанныхДней = новый Массив;
	КонецЕсли;
	
	Если ЗначенияДанных.МассивОбработанныхДней.найти(День) = Неопределено тогда    
		ЗначенияДанных.МассивОбработанныхДней.Добавить(День);
	КонецЕсли;
	
	
	МЗ = РегистрыСведений.ДанныеЗакрытияМесяцаПоСкладу.СоздатьМенеджерЗаписи();
	МЗ.Склад = Склад;
	мз.Период = НачалоМесяца(месяц);       
	МЗ.Значение = новый ХранилищеЗначения(ЗначенияДанных);
	МЗ.Записать(Истина);
	
КонецПроцедуры    

  &НаСервере       
Процедура ОчиститьОбработанныеДни(Склад,Месяц) экспорт     
	если не ЗначениеЗаполнено(склад) тогда
		ВызватьИсключение "Заполните склад";
	КонецЕсли;
	
	если не ЗначениеЗаполнено(Месяц) тогда
		ВызватьИсключение "Заполните месяц";
	КонецЕсли;
	
	
	
	ТаблицаОстатков = ПолучитьОстаткиСкладаНаНачалоОткрытогоМесяца(Склад,Месяц);  
	
	ЗначенияДанных = ПрочитатьДанныеЗакрытияМесяцаПоСкладу(Склад,Месяц);
	
	если ЗначенияДанных = Неопределено тогда
		ЗначенияДанных = новый Структура();
	КонецЕсли;                
	
	если не ЗначенияДанных.Свойство("МассивОбработанныхДней") тогда
		ЗначенияДанных.Вставить("МассивОбработанныхДней");  
	КонецЕсли;
	ЗначенияДанных.МассивОбработанныхДней = новый Массив;
	
	
	
	МЗ = РегистрыСведений.ДанныеЗакрытияМесяцаПоСкладу.СоздатьМенеджерЗаписи();
	МЗ.Склад = Склад;
	мз.Период = НачалоМесяца(месяц);       
	МЗ.Значение = новый ХранилищеЗначения(ЗначенияДанных);
	МЗ.Записать(Истина);
	
КонецПроцедуры   



&НаСервере  
//Восстановление остатков по виртуальным складам
Процедура ВосстановитьОстаткиВиртуальныхСкладов(ФизическийСклад,ЗакрываемыйМесяц,МассивСозданныхПРМ,ДопПараметры = Неопределено) экспорт     
	
	//   УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияВосстановитьОстаткиВиртуальныхСкладов",100);
	//
	//   УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",МассивСозданныхПРМ);  		
	
	ВыполнятьФоново = Истина;
	если ТипЗнч(ДопПараметры) = Тип("Структура") тогда 
		если ДопПараметры.Свойство("ВыполнятьФоново") и ДопПараметры.ВыполнятьФоново = ложь тогда
			ВыполнятьФоново = Ложь;
		КонецЕсли;
	КонецЕсли;
	МассивСообщений = новый массив;
	
	МассивСкладов = ПолучитьМассивВиртуальныхСкладов(ФизическийСклад,ложь);       
	
	ЗапросНаличиеНаФизСкладе = новый запрос;    
	ЗапросНаличиеНаФизСкладе.УстановитьПараметр("Склад",ФизическийСклад);	 
	ЗапросНаличиеНаФизСкладе.УстановитьПараметр("Дата2",КонецМесяца(ЗакрываемыйМесяц)+1);	 
	ЗапросНаличиеНаФизСкладе.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Дата2,
	|			Склад = &Склад) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0";        
	ТаблицаНаличия = ЗапросНаличиеНаФизСкладе.Выполнить().Выгрузить();	
	
	
	
	
	ТаблицаОстатковСтарая = ПрочитатьСохранённыеОстаткиСклада(ФизическийСклад,ЗакрываемыйМесяц); 	
	ТаблицаОстатковНовая = ПолучитьОстаткиСкладаНаНачалоОткрытогоМесяца(ФизическийСклад,ЗакрываемыйМесяц);  
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Номенклатура КАК Номенклатура,
	               |	ТЗ.КоличествоОстаток КАК КоличествоОстаток,
	               |	ТЗ.Склад КАК Склад
	               |ПОМЕСТИТЬ ВТСтарая
	               |ИЗ
	               |	&ТаблицаОстатковСтарая КАК ТЗ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ.Номенклатура КАК Номенклатура,
	               |	ТЗ.КоличествоОстаток КАК КоличествоОстаток,
	               |	ТЗ.Склад КАК Склад
	               |ПОМЕСТИТЬ ВТНовая
	               |ИЗ
	               |	&ТаблицаОстатковНовая КАК ТЗ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТНовая.Номенклатура, ВТСтарая.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ВТНовая.Склад, ВТСтарая.Склад) КАК Склад,
	               |	ЕСТЬNULL(ВТНовая.КоличествоОстаток, 0) - ЕСТЬNULL(ВТСтарая.КоличествоОстаток, 0) КАК Дельта
	               |ПОМЕСТИТЬ Сводная
	               |ИЗ
	               |	ВТСтарая КАК ВТСтарая
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТНовая КАК ВТНовая
	               |		ПО ВТСтарая.Склад = ВТНовая.Склад
	               |			И ВТСтарая.Номенклатура = ВТНовая.Номенклатура
	               |ГДЕ
	               |	ЕСТЬNULL(ВТНовая.КоличествоОстаток, 0) - ЕСТЬNULL(ВТСтарая.КоличествоОстаток, 0) <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сводная.Номенклатура КАК Номенклатура,
	               |	Сводная.Склад КАК Склад,
	               |	Сводная.Дельта КАК КоличествоОстаток
	               |ИЗ
	               |	Сводная КАК Сводная
	               |ГДЕ
	               |	Сводная.Дельта > 0
	               |ИТОГИ
	               |	СУММА(КоличествоОстаток)
	               |ПО
	               |	Склад
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сводная.Номенклатура КАК Номенклатура,
	               |	Сводная.Склад КАК Склад,
	               |	-Сводная.Дельта КАК КоличествоОстаток
	               |ИЗ
	               |	Сводная КАК Сводная
	               |ГДЕ
	               |	Сводная.Дельта < 0
	               |ИТОГИ
	               |	СУММА(КоличествоОстаток)
	               |ПО
	               |	Склад";                  
	запрос.УстановитьПараметр("ТаблицаОстатковСтарая",ТаблицаОстатковСтарая); 
	запрос.УстановитьПараметр("ТаблицаОстатковНовая",ТаблицаОстатковНовая);
	
	ПакетРезультатов = запрос.ВыполнитьПакет();
	ВыборкаНедостачиПоСкладам =  ПакетРезультатов[4].выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
	ВыборкаИзлишкиПоСкладам = ПакетРезультатов[3].выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
	Пока ВыборкаИзлишкиПоСкладам.Следующий() цикл

		ПРМОб = СоздатьПеремещение(ВыборкаИзлишкиПоСкладам.Склад,ФизическийСклад,КонецМесяца(ЗакрываемыйМесяц),"Создано обработкой закрытия минусов. Для списания излишков после закрытия.");
		
		ВыборкаПоТоварам = ВыборкаИзлишкиПоСкладам.Выбрать();  
		Сч=1;      
		КоличествоСТрок = ВыборкаПоТоварам.Количество();
		
		если ВыполнятьФоново тогда
			УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",
			СтрШаблон("Создаётся на изьятие излишков ПРМ с %1 количество строк %2",ВыборкаИзлишкиПоСкладам.Склад,КоличествоСтрок));
		КонецЕсли;          
		
		пока ВыборкаПоТоварам.Следующий() цикл
			ДобавитьСтрокуПРМ(ПРМОб,ВыборкаПоТоварам.Номенклатура,ВыборкаПоТоварам.КоличествоОстаток);		
			если ВыполнятьФоново тогда
				Процент = 100*сч/КоличествоСтрок; 
				УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияВосстановитьОстаткиВиртуальныхСкладов",Процент);  
			КонецЕсли;      
			сч = сч+1;
		КонецЦикла;      
		
		
		если ВыполнятьФоново тогда			
			УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",
			СтрШаблон("Начало проведения %1 по складу %2", ПРМОб.Номер,ВыборкаИзлишкиПоСкладам.Склад));
		КонецЕсли;        
		
		попытка   
			если ПРМОб.Товары.Итог("Количество") > 0 тогда
				
				ПРМОб.Записать(РежимЗаписиДокумента.Проведение);   
				МассивСозданныхПРМ.Добавить(ПРМОб.Ссылка);   
				если ВыполнятьФоново тогда			
					УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",
					СтрШаблон("ПРМ %1 проведен", ПРМОб.Номер));
				КонецЕсли; 
			КонецЕсли;
		Исключение       
			МассивСообщений.Добавить(СтрШаблон("Не удалось создать ПРМ со склада %1. %2",ВыборкаИзлишкиПоСкладам.Склад,ОписаниеОшибки())); 
			если ВыполнятьФоново тогда			
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",
				СтрШаблон("ПРМ %1 не проведен %2", ПРМОб.Номер, ОписаниеОшибки()));
			КонецЕсли;     
		КонецПопытки;
	КонецЦикла;	
	
	
	
	Пока ВыборкаНедостачиПоСкладам.Следующий() цикл
		
		ПРМОб = СоздатьПеремещение(ФизическийСклад,ВыборкаНедостачиПоСкладам.Склад,КонецМесяца(ЗакрываемыйМесяц),"Создано обработкой закрытия минусов. Для восстановления остатков после закрытия.");
		
		ВыборкаПоТоварам = ВыборкаНедостачиПоСкладам.Выбрать();  
		Сч=1;      
		КоличествоСТрок = ВыборкаПоТоварам.Количество();
		
		если ВыполнятьФоново тогда
			УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",
			СтрШаблон("Создаётся на закрытиие оставшихся минусов ПРМ на %1 количество строк %2",ВыборкаНедостачиПоСкладам.Склад,КоличествоСтрок));
		КонецЕсли;          
		
		пока ВыборкаПоТоварам.Следующий() цикл     
			СтрокаНаличия = ТаблицаНаличия.Найти(ВыборкаПоТоварам.Номенклатура,"Номенклатура");    
			НужноСписать = ВыборкаПоТоварам.КоличествоОстаток;   
			Номенклатура = ВыборкаПоТоварам.Номенклатура;
			
			если СтрокаНаличия <> Неопределено тогда 
				если СтрокаНаличия.КоличествоОстаток < НужноСписать тогда
					МассивСообщений.Добавить(СтрШаблон("Неудалось вернуть остаток в исходное состояние по складу %1 по номенклатуре %2 с кодом %3. Нужно %4, есть в наличии %5",
					ВыборкаНедостачиПоСкладам.Склад,Номенклатура,номенклатура.код,НужноСписать,СтрокаНаличия.КоличествоОстаток));    
					НужноСписать =  СтрокаНаличия.КоличествоОстаток;
					СтрокаНаличия.КоличествоОстаток = 0;
				Иначе
					СтрокаНаличия.КоличествоОстаток = СтрокаНаличия.КоличествоОстаток - НужноСписать;
				КонецЕсли;                         
			иначе
				НеУдалосьЗакрытьДень = Истина;
				МассивСообщений.Добавить(СтрШаблон("Неудалось вернуть остаток в исходное состояние по складу %1 по номенклатуре %2 с кодом %3. Нужно %4, есть в наличии %5",
				ВыборкаНедостачиПоСкладам.Склад,Номенклатура,номенклатура.код,НужноСписать,0));   					
				Продолжить;				
			КонецЕсли;  
			
			ДобавитьСтрокуПРМ(ПРМОб,ВыборкаПоТоварам.Номенклатура,НужноСписать);		
			если ВыполнятьФоново тогда
				Процент = 100*сч/КоличествоСтрок; 
				УведомленияКлиента.ОтправитьУведомление("ПроцентВыполненияВосстановитьОстаткиВиртуальныхСкладов",Процент);  
			КонецЕсли;      
			сч = сч+1;
		КонецЦикла;      
		
		
		если ВыполнятьФоново тогда			
			УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",
			СтрШаблон("Начало проведения %1 по складу %2", ПРМОб.Номер,ВыборкаНедостачиПоСкладам.Склад));
		КонецЕсли;        
		
		попытка       
			если ПРМОб.Товары.Итог("Количество") > 0 тогда
				ПРМОб.Записать(РежимЗаписиДокумента.Проведение);   
				МассивСозданныхПРМ.Добавить(ПРМОб.Ссылка);   
				если ВыполнятьФоново тогда			
					УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",
					СтрШаблон("ПРМ %1 проведен", ПРМОб.Номер));
				КонецЕсли;     
			КонецЕсли;
		Исключение       
			МассивСообщений.Добавить(СтрШаблон("Не удалось создать ПРМ на склад %1. %2",ВыборкаНедостачиПоСкладам.Склад,ОписаниеОшибки())); 
			если ВыполнятьФоново тогда			
				УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",
				СтрШаблон("ПРМ %1 не проведен %2", ПРМОб.Номер, ОписаниеОшибки()));
			КонецЕсли;     
		КонецПопытки;
	КонецЦикла;	
	
	
	
	если ВыполнятьФоново тогда
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",1000);
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",СтрСоединить(МассивСообщений,символы.ПС));        
		УведомленияКлиента.ОтправитьУведомление("ОповещенияФоновыеВосстановитьОстаткиВиртуальныхСкладов",МассивСозданныхПРМ);  		
	иначе
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = СтрСоединить(МассивСообщений,символы.ПС);
		Сообщение.Сообщить();
	КонецЕсли;	
	
	
КонецПроцедуры




//////////////////////////////////////////////////////
//МелкиеФункции
&НаСервере
Функция СоздатьПеремещение(Склад,СкладПолучатель,ДатаПРМ,Комментарий)
	
	СтруктураДокумента = новый Структура();
	СтруктураДокумента.Вставить("Склад",Склад);
	СтруктураДокумента.Вставить("СкладПолучатель",СкладПолучатель);  
	СтруктураДокумента.Вставить("ИБ",Справочники.ИБ.НайтиПоКоду("SSP"));  
	СтруктураДокумента.Вставить("Менеджер",ПараметрыСеанса.Пользователь.ФизЛицо);  
	СтруктураДокумента.Вставить("Автор",ПараметрыСеанса.Пользователь);
	СтруктураДокумента.Вставить("Организация",Справочники.Организации.НайтиПоКоду("SS-001"));
	СтруктураДокумента.Вставить("Организация",Справочники.Организации.НайтиПоКоду("SS-001"));
	СтруктураДокумента.Вставить("Комментарий",Комментарий);
	СтруктураДокумента.Вставить("СостояниеНакладной",Перечисления.СостоянияНакладной.Отгружена);
	СтруктураДокумента.Вставить("СостояниеНакладнойУПолучателя",Перечисления.СостоянияНакладной.Принята);
	СтруктураДокумента.Вставить("Отгружен",Перечисления.Отгружен.Отгружен);
	СтруктураДокумента.Вставить("Дата",ДатаПРМ);
	СтруктураДокумента.Вставить("ДатаПриемки",ДатаПРМ);      
	СтруктураДокумента.Вставить("ДатаОтгрузки",ДатаПРМ);
	
	СтруктураДокумента.Вставить("ДатаПриемки",ПараметрыСеанса.ВалютаУпр);
	СтруктураДокумента.Вставить("Курс",1);
	
	ПРМОб = ЗаполнениеДокументов.НайтиСоздатьПроизвольныйДокументОбъект("Перемещение",СтруктураДокумента);    
	УстановитьПунктДоставкиКлиентСервер(ПРМОб,"СкладПолучатель","ПунктДоставки");
	
	возврат ПРМОб;
КонецФункции   

&НаСервере
Функция ДобавитьСтрокуПРМ (ПРМОб,Номенклатура,Количество)
	СтрТЧ = ПРМОб.Товары.Добавить(); 
	СтрТЧ.Номенклатура	=	Номенклатура;
	СтрТЧ.Заявка		=	Количество;
	стртч.ПодтвержденнаяЗаявка				=	Количество;			
	стртч.ПодтвержденнаяЗаявкаПеремещения	=	Количество;
	СтрТЧ.Количество						=	Количество;	   
	
	ДопПараметры = новый Структура("ОтключитьРасчетСкидок,ЗаполнятьСтавкуНДСИзРодителя,КоэффициентВсегдаОдин,ПредопределеннаяЦена,ОтключитьРасчетЛогистическихРеквизитов"
	,Истина,Истина,Истина,1,Истина);   
	
	ПриИзмененииНоменклатурыТабЧасти(СтрТЧ, ПРМОб,,,ДопПараметры);
	РассчитатьСуммуТабЧасти(СтрТЧ, ПРМОб,,ДопПараметры); 	
КонецФункции   


&НаСервере
Функция ПолучитьМассивВиртуальныхСкладов (Склад, ДобавлятьТекущийФизическийСклад = ложь)  экспорт 
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|Склады.ФизическийСклад = &Склад
	|	И не Склады.ПометкаУдаления";
	запрос.УстановитьПараметр("Склад",Склад);
	МассивСкладов = запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");   
	если ДобавлятьТекущийФизическийСклад тогда
		МассивСкладов.Добавить(Склад);
	КонецЕсли;
	возврат МассивСкладов;
	
КонецФункции






#Область СохранениеПромежуточныхРезультатов
 
&НаСервере
Процедура ЗаписатьМассивДанныхВДанныеЗакрытияМесяцаПоСкладу (Склад,Месяц,МассивЗначениеПоля,ИмяПоля,ЭтоУдаление = ложь)      
	
	ЗначенияДанных = ПрочитатьДанныеЗакрытияМесяцаПоСкладу(Склад,НачалоМесяца(Месяц)); 
	если ЗначенияДанных = Неопределено тогда
		ЗначенияДанных = новый Структура();
	КонецЕсли;               
	
	если не ЗначенияДанных.Свойство(ИмяПоля) тогда
		ЗначенияДанных.Вставить(ИмяПоля,новый Массив);
	КонецЕсли;    
	
	если  ЭтоУдаление тогда       
		ЗначенияДанных[ИмяПоля] = новый Массив;
	иначе
		Для каждого СтрокаМассива из МассивЗначениеПоля цикл 
			если ЗначенияДанных[ИмяПоля].Найти(СтрокаМассива) = Неопределено тогда
				ЗначенияДанных[ИмяПоля].добавить(СтрокаМассива);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	
	МЗ = РегистрыСведений.ДанныеЗакрытияМесяцаПоСкладу.СоздатьМенеджерЗаписи();
	МЗ.Склад = Склад;
	мз.Период = НачалоМесяца(месяц);       
	МЗ.Значение = новый ХранилищеЗначения(ЗначенияДанных);
	МЗ.Записать(Истина);
	
	
КонецПроцедуры          


&НаСервере
Функция ПрочитатьМассивДанныхЗакрытияМесяцаПоСкладу (Склад,Месяц,ИмяПоля) экспорт     
	
	ЗначенияДанных = ПрочитатьДанныеЗакрытияМесяцаПоСкладу(Склад,НачалоМесяца(Месяц)); 
	если ЗначенияДанных = Неопределено тогда
		ЗначенияДанных = новый Структура();
	КонецЕсли;               
	
	если не ЗначенияДанных.Свойство(ИмяПоля) тогда
		возврат новый Массив;  
	иначе
		возврат ЗначенияДанных[ИмяПоля]; 
	КонецЕсли;    
	
КонецФункции


&НаСервере      
Функция ПрочитатьСохранённыеОстаткиСклада(Склад,Месяц) экспорт    
	ЗначенияДанных = ПрочитатьДанныеЗакрытияМесяцаПоСкладу(Склад,Месяц);
	
	если ЗначенияДанных = Неопределено тогда
		возврат Неопределено;
	КонецЕсли;
	
	Если ЗначенияДанных.Свойство("ТаблицаОстатков")  тогда
		возврат ЗначенияДанных.ТаблицаОстатков;
	КонецЕсли;
	
КонецФункции

&НаСервере       
Процедура ЗаписатьОстаткиСклада(Склад,Месяц) экспорт     
	если не ЗначениеЗаполнено(склад) тогда
		ВызватьИсключение "Заполните склад";
	КонецЕсли;
	
	если не ЗначениеЗаполнено(Месяц) тогда
		ВызватьИсключение "Заполните месяц";
	КонецЕсли;
	
	
	
	ТаблицаОстатков = ПолучитьОстаткиСкладаНаНачалоОткрытогоМесяца(Склад,Месяц);  
	
	ЗначенияДанных = ПрочитатьДанныеЗакрытияМесяцаПоСкладу(Склад,Месяц); 
	если ЗначенияДанных = Неопределено тогда
		ЗначенияДанных = новый Структура();
	КонецЕсли; 
	если не ЗначенияДанных.Свойство("ТаблицаОстатков") тогда
		ЗначенияДанных.Вставить("ТаблицаОстатков");
	КонецЕсли;
	
	ЗначенияДанных.ТаблицаОстатков = ТаблицаОстатков;
	
	
	МЗ = РегистрыСведений.ДанныеЗакрытияМесяцаПоСкладу.СоздатьМенеджерЗаписи();
	МЗ.Склад = Склад;
	мз.Период = НачалоМесяца(месяц);       
	МЗ.Значение = новый ХранилищеЗначения(ЗначенияДанных);
	МЗ.Записать(Истина);
	
КонецПроцедуры   

&НаСервере        
Функция ПрочитатьДанныеЗакрытияМесяцаПоСкладу(Склад,Месяц)  экспорт
	если не ЗначениеЗаполнено(склад) тогда
		ВызватьИсключение "Заполните склад";
	КонецЕсли;
	
	если не ЗначениеЗаполнено(Месяц) тогда
		ВызватьИсключение "Заполните месяц";
	КонецЕсли;
	
	
	СтруктураЗначений = РегистрыСведений.ДанныеЗакрытияМесяцаПоСкладу.Получить(НачалоМесяца(Месяц),новый Структура("Склад",Склад));  
	возврат СтруктураЗначений.Значение.Получить();
КонецФункции

&НаСервере        
Функция ПолучитьОстаткиСкладаНаНачалоОткрытогоМесяца(Склад,Месяц) экспорт 
	МассивСкладов = Обработки.АРМ_ЗакрытиеМинусов.ПолучитьМассивВиртуальныхСкладов(Склад,ложь);
	запрос = новый запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ОстаткиТМЦОстатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата2, Склад В (&МассивСкладов)) КАК ОстаткиТМЦОстатки
	|ГДЕ
	|	ОстаткиТМЦОстатки.КоличествоОстаток > 0";     
	запрос.УстановитьПараметр("Дата2",КонецМесяца(месяц)+1);
	запрос.УстановитьПараметр("МассивСкладов",МассивСкладов);
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции
   

&НаСервере       
Функция ОстаткиСкладовЗаписаны(Склад,Месяц) экспорт   
	ТаблицаОстатков = ПрочитатьСохранённыеОстаткиСклада(Склад,Месяц);
	если ТаблицаОстатков = Неопределено  тогда
		Возврат ложь;
	иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

  




#КонецОбласти
